{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# Hello World\n",
    "\n",
    "This notebook walks through basic code examples for integrating various packages with Neo4j, including `py2neo`, `ipython-cypher`, `pandas`, `networkx`, `igraph`, and `jgraph`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# py2neo\n",
    "\n",
    "`py2neo` is one of Neo4j's Python drivers. It offers a fully-featured interface for interacting with your data in Neo4j. Install `py2neo` with `pip install py2neo`."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Connect\n",
    "\n",
    "Connect to Neo4j with the `Graph` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "\n",
    "graph = Graph()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Nodes\n",
    "\n",
    "Create nodes with the `Node` class. The first argument is the node's label. The remaining arguments are an arbitrary amount of node properties or key-value pairs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [],
   "source": [
    "from py2neo import Node\n",
    "\n",
    "nicole = Node(\"Person\", name=\"Nicole\", age=24)\n",
    "drew = Node(\"Person\", name=\"Drew\", age=20)\n",
    "\n",
    "mtdew = Node(\"Drink\", name=\"Mountain Dew\", calories=9000)\n",
    "cokezero = Node(\"Drink\", name=\"Coke Zero\", calories=0)\n",
    "\n",
    "coke = Node(\"Manufacturer\", name=\"Coca Cola\")\n",
    "pepsi = Node(\"Manufacturer\", name=\"Pepsi\")\n",
    "\n",
    "for _ in [nicole, drew, mtdew, cokezero, coke, pepsi]: \n",
    "    graph.create(_)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-77c26a27-8724-436a-8621-9e42f5f8764c.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f6eec9cfe48>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from scripts.vis import draw\n",
    "\n",
    "options = {\"Person\": \"name\", \"Drink\": \"name\", \"Manufacturer\": \"name\"}\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "skip"
    }
   },
   "source": [
    "P.S. - If you want to check out what's going on behind the scenes for the `draw()` function used above, take a look at [`scripts/vis.py`](https://github.com/nicolewhite/neo4j-jupyter/blob/master/scripts/vis.py)."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Relationships\n",
    "\n",
    "Create relationships between nodes with the `Relationship` class."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"400\"\n",
       "            src=\"figure/graph-67353396-9f04-4951-8f3a-2043408a2746.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7f6eec9d4908>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Relationship\n",
    "\n",
    "graph.create(Relationship(nicole, \"LIKES\", cokezero))\n",
    "graph.create(Relationship(nicole, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(drew, \"LIKES\", mtdew))\n",
    "graph.create(Relationship(coke, \"MAKES\", cokezero))\n",
    "graph.create(Relationship(pepsi, \"MAKES\", mtdew))\n",
    "\n",
    "draw(graph, options)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "~~Retrieve Cypher query results with `Graph.cypher.execute`.~~\n",
    "\n",
    "According to the [v3 Documentation for py2neo](http://py2neo.org/v3/database.html#the-graph):\n",
    "\n",
    "> **Note:** The previous version of py2neo allowed Cypher execution through `Graph.cypher.execute()`. This facility is now instead accessible via `Graph.run()` and returns a lazily-evaluated `Cursor` rather than an eagerly-evaluated `RecordList`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('name': 'Nicole', 'drink': 'Mountain Dew'),\n",
       " ('name': 'Nicole', 'drink': 'Coke Zero'),\n",
       " ('name': 'Drew', 'drink': 'Mountain Dew')]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name AS name, drink.name AS drink\n",
    "\"\"\"\n",
    "\n",
    "data = [_ for _ in graph.run(query)]\n",
    "\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "('name': 'Nicole', 'drink': 'Mountain Dew')"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "data[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nicole likes to drink Mountain Dew.\n",
      "Nicole likes to drink Coke Zero.\n",
      "Drew likes to drink Mountain Dew.\n"
     ]
    }
   ],
   "source": [
    "for row in data:\n",
    "    print(\"{name} likes to drink {drink}.\".format(**row))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Parameterized Cypher\n",
    "\n",
    "Pass parameters to Cypher queries by passing additional key-value arguments to `Graph.cypher.execute.` Parameters in Cypher are named and are wrapped in curly braces."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " name    avg_calories \n",
      "----------------------\n",
      " Nicole  4500.0       \n"
     ]
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (p:Person)-[:LIKES]->(drink:Drink)\n",
    "WHERE p.name = {name}\n",
    "RETURN p.name AS name, AVG(drink.calories) AS avg_calories\n",
    "\"\"\"\n",
    "\n",
    "data = graph.run(query, name=\"Nicole\")\n",
    "\n",
    "data.dump()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# ipython-cypher\n",
    "\n",
    "`ipython-cypher` exposes `%cypher` magic in Jupyter. Install `ipython-cypher` with `pip install ipython-cypher`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/conda/lib/python3.5/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.\n",
      "  \"You should import from traitlets.config instead.\", ShimWarning)\n",
      "/opt/conda/lib/python3.5/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.\n",
      "  warn(\"IPython.utils.traitlets has moved to a top-level traitlets package.\")\n"
     ]
    }
   ],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Cypher\n",
    "\n",
    "`%cypher` is intended for one-line Cypher queries and `%%cypher` is intended for multi-line Cypher queries. Placing `%%cypher` above a Cypher query will display that query's results."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>person.name</th>\n",
       "        <th>drink.name</th>\n",
       "        <th>drink.calories</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Nicole</td>\n",
       "        <td>Coke Zero</td>\n",
       "        <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drew</td>\n",
       "        <td>Mountain Dew</td>\n",
       "        <td>9000</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Nicole', 'Mountain Dew', 9000],\n",
       " ['Nicole', 'Coke Zero', 0],\n",
       " ['Drew', 'Mountain Dew', 9000]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name, drink.calories"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## Pandas Data Frames\n",
    "\n",
    "Cypher query results can be coerced to `pandas` data frames with the `get_dataframe` method. To assign Cypher query results to a variable, you need to use `%cypher` and separate lines with \\\\. You'll first need to install `pandas` with `pip install pandas`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Drew</td>\n",
       "      <td>Mountain Dew</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name         drink\n",
       "0  Nicole  Mountain Dew\n",
       "1  Nicole     Coke Zero\n",
       "2    Drew  Mountain Dew"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "results = %cypher MATCH (person:Person)-[:LIKES]->(drink:Drink) \\\n",
    "                  RETURN person.name AS name, drink.name AS drink\n",
    "    \n",
    "df = results.get_dataframe()\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "RangeIndex(start=0, stop=3, step=1)"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.index"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>drink</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Nicole</td>\n",
       "      <td>Coke Zero</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     name      drink\n",
       "1  Nicole  Coke Zero"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.iloc[[1]]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    Nicole\n",
       "1    Nicole\n",
       "2      Drew\n",
       "Name: name, dtype: object"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[\"name\"]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "source": [
    "## NetworkX Graphs\n",
    "\n",
    "Cypher query results can be coerced to `NetworkX` MultiDiGraphs, graphs that permit multiple edges between nodes, with the `get_graph` method. You'll first need to install `NetworkX` with `pip install networkx`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3 rows affected.\n"
     ]
    },
    {
     "data": {
      "image/png": "iVBORw0KGgoAAAANSUhEUgAAAeIAAAFBCAYAAACrYazjAAAABHNCSVQICAgIfAhkiAAAAAlwSFlz\nAAALEgAACxIB0t1+/AAAIABJREFUeJzt3Xt4VeWd9vF7QYBkhzQkJhwMBgyQQiVppSSjSE5kh0NE\na5zSqq0CWvXFVsUZXpnoOC1vvSZVM1U6ZbiklQbqWGesFyMIISUHkogoCagJtRpiRqMCOZgAgSQc\nkv3+MWWNu0DJ+dmH7+e/rGZv7va64O5vPWs9j+VyuVwCAABGDDMdAAAAf0YRAwBgEEUMAIBBFDEA\nAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUM\nAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQR\nAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZR\nxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBBFDEAAAZRxAAAGEQRAwBgEEUMAIBB\nFDEAAAZRxAAAGBRgOgAA39PY2KjNeXmqqarSyePHNTo0VLHx8Vq6fLkiIyNNxwM8iuVyuVymQwDw\nDRUVFVqbk6Pt+fm6VVJCZ6dCJLVJ2hcUpC0ul25ctEgPZ2crISHBcFrAM1DEAAbEhvXr9eNVq7S6\no0NLXS6FXeR3WiXlWZaeDgrSmtxc3bdixVDHBDwORQyg3zasX6+nVq1SQXu7pvbg92slLXA4tJoy\nBihiAP1TUVGhm1NTVd7DEj6vVlKSw6FtpaWaPXv2YMUDPB5PTQPol7U5OVrd0dGrEpakqZIe7ejQ\n2pycwYgFeA0mYgB91tjYqK9OmqS6zs6LrglfToukKYGBqqmv52lq+C0mYgB9tjkvT1lSn0pYksIl\nZVmWNuflDVwowMtQxAD6rKaqSomdnf36joSODtVUVw9QIsD7sKEHgF5rbm5WcXGx3iwvV0o/vytE\nUltr60DEArwSRQzgstrb21VeXq7CwkIVFhbq3XfflSQF6X826+iPNkkhYX29uQ14P4oYwAXOnTun\nyspKFRYWqqioSG+++abOnDlzwe91SiqV9H/68WdVBAXpmri4fnwD4N14ahqAXC6XPvzwQ3viLSkp\n0YkTJ3r02UBJh9W3B7Z4ahpgIgb81uHDh1VUVGRPvZ9//nmPP2tZlq699lo5nU4deOMN5e3dq0f6\n8P/p8yxLizMzKWH4NYoY8BMnTpxQaWmpPfW+//77vfp8TEyMnE6nnE6n0tLSFBERIel/d9a6qQ87\na/0/SZvuuqtXOQBfw61pwEedOXNGb731lj3xvv322+rq6urx5yMiIpSeni6n06n09HRdffXVl/zd\nvuw1nSSpQdLVMTEqLy/XlVde2eNsgC+hiAEf0d3drYMHD9oTb2lpqdrb23v8+aCgICUnJ9tTb3x8\nvIYN6/lWA+dPX3q0o0PLLnH6UoukjZJ+qv95Wvr8Pz4zZsxQWVmZPWUD/oQiBrzYJ598YhdvUVGR\nmpqaevzZYcOGKTEx0S7e6667TqNGjepXnsrKSq3NydHrO3Yoy7KU0NFhn0dc8aXziJvb21VQUOD2\n2VmzZqm4uFihoaH9ygB4G4oY8CJffPGFSkpK7Iesamtre/X56dOn28WbkpKiMWPGDErOpqYmbc7L\nU011tdpaWxUSFqbYuDjdtWyZIiMjdfbsWS1ZskSvvfaa2+duuOEGFRQUKDg4eFByAZ6IIga8QF1d\nnb7zne/owIED6s1f2QkTJtjFm56erqioqEFM2TudnZ266aabVFhY6HZ9/vz52rp1a7+nc8BbUMSA\nFzhx4oQiIyMvuqnGl4WEhCgtLc1+yGrGjBmyLGuIUvbeqVOnNH/+fL355ptu17OysvSf//mfCgjg\nxQ74PooY8EDd3d2qrq62137feOMNWZZ1wSYbI0aM0PXXX29PvQkJCV5XXseOHVNaWpq9beZ53//+\n97Vp06ZePTAGeCOKGPAQf/ng1ZgxY+yCTU1N1YYNG5Sdna2vf/3r9vWkpCSfWE9tampScnKyPvjg\nA7frK1as0Lp16zx6qgf6iyIGDDn/4NX54j1x4oTbem50dLTb7zc3N6u7u1tjx441lHhwff7550pK\nStJ///d/u11/9NFH9bOf/Ywyhs+iiIEh0tHRoT179thT76FDhzR37ly7fGfOnOn3ZVNXV6e5c+fq\nyJEjbteffPJJPf7444ZSAYOLIgYGSVdXlw4cOGAX7759+9xuKycmJmrkyJGmY3qc999/X8nJyfri\niy/crq9du1YPPfSQoVTA4KGIgQHicrl06NAh+1ZzSUmJoqKi7FvNycnJ+spXvmI6plc4cOCA0tLS\nLng4bePGjVq+fLmhVMDgoIiBfmhoaLA31ygsLJTL5bIn3nnz5mnChAmmI3qtPXv2aP78+W7bdA4b\nNkwvv/yylixZYjAZMLAoYqAX2traVFZWZk+9n376qdLS0uypNzY21u/XeQfSrl27tHjxYrf3pwMC\nAvTaa68pMzPTYDJg4FDEwF9x9uxZ7du3z55433nnHbf9mWfNmuV17+16my1btmjJkiVuJ0cFBgYq\nPz9fqamp5oIBA4QiBr7E5XLpj3/8o1285eXlmjp1qj3xzp07Vw6Hw3RMv/Piiy/qzjvvdLs2evRo\nFRUVKTEx0VAqYGBQxPB7n376qX2rubCwUMHBwfbEm5aWxtF8HmL9+vV64IEH3K6FhYWptLRUcXFx\nhlIB/UcRw++0trZq9+7d9tTb0tJi782cnp6uq6++2nREXMIzzzyjRx991O3auHHjVFZWptjYWEOp\ngP6hiOHzOjs79eabb9pT75/+9CfdcMMNdvnGx8ezn7EXeeKJJ/Tkk0+6Xbvqqqv0xhtvXLAbGeAN\nKGL4nO7ubr377rv2xLt3717NnDnTvt183XXXccSeF3O5XFq5cqV+8YtfuF2fOnWqysvLNX78eEPJ\ngL6hiOH1XC6X6urq7OItLi7WuHHj7FvNqampCg0NNR0TA6i7u1s/+MEP9Jvf/MbtelxcnHbv3q3w\n8HBDyYDeo4jhlRobG1VcXGw/YHX69Gm3AxOioqJMR8Qg6+rq0u23365XXnnF7XpiYqIKCwsVEhJi\nKBnQOxQxvMKpU6dUXl5uT70ff/yxUlJS7PKdPn06G2n4oTNnzigrK0s7duxwu56SkqL8/HwFBQUZ\nSgb0HEUMj3Tu3DlVVFTYD1jt379fs2bNsos3ISGBjTQg6X9OtVq0aJFKS0vdrmdmZmrLli0crAGP\nRxHDI7hcLn3wwQf2xFtaWqrJkyfbxZuUlKTg4GDTMeGh2tra5HQ6tW/fPrfrS5Ys0e9+9zsNHz7c\nUDLg8ihiGPP555+7HZgwcuRIZWRkKD09XfPmzdPYsWNNR4QXaWlpUWpqqqqrq92ur1q1Ss8884yh\nVMDlUcQYMsePH1dpaaldvA0NDZo3b5499cbExLDOi345evSokpOTdejQIUnSmDFjtH//fsXExBhO\nBlwaRYxBc/r0ab311lt28R48eFDXX3+9Xbzf+MY32EgDA66+vl5z585VYGCgurq69MADD+jv//7v\nTccCLokixoDp7u5WVVWV/YDVnj17NH36dLt458yZo8DAQNMx4Qdqa2sVGhqqzs5OJScnKzs7W/fd\nd5/pWMBFUcTol48//tieeIuKihQeHm4Xb2pqqsLCwkxHhJ+rra1VSkqKnnnmGd1xxx2m4wAXoIjR\nK1988YWKi4vt8j116pS9iUZ6ejp7/cIjHTx4UE6nU88//7y+9a1vmY4DuKGI8Ve1t7drz549dvHW\n1tYqKSnJnnqvueYaHrCCV6isrFRmZqZeeuklOZ1O03EAG0UMN11dXdq/f79dvBUVFfrGN75hF29i\nYqJGjBhhOibQJ+Xl5br11lv12muvac6cOabjAJIoYr/ncrlUU1Njr/Hu3r1bUVFRdvEmJyezZy98\nys6dO3XXXXepoKBA1157rek4AEVsSmNjozbn5ammqkonjx/X6NBQxcbHa+ny5YqMjBzUP/vo0aNu\nG2lYlmUX77x58zhGDj7v1Vdf1Y9+9CMVFxdrxowZpuPAz1HEQ6yiokJrc3K0PT9ft0pK6OxUiKQ2\nSfuCgrTF5dKNixbp4exsJSQkDMif2dbW5raRxuHDh5WWlqb09HQ5nU5NmzaNdV74nc2bN+vxxx9X\nWVmZrr76atNx4Mco4iG0Yf16/XjVKq3u6NBSl0sXe7GnVVKeZenpoCCtyc3VfStW9PrPOXv2rN5+\n+227eN977z0lJibaU++sWbPYexeQtG7dOv385z9XWVkZR2fCGIp4iGxYv15PrVqlgvZ2Te3B79dK\nWuBwaHUPytjlcungwYN28ZaXlys2NtYu3htuuIHj4IBL+NnPfqbNmzerrKxMERERpuPAD1HEQ6Ci\nokI3p6aqvIclfF6tpCSHQ9tKSzV79my3/6y+vt5+wKqoqEijR4+2izctLU1XXHHFgP53AHzZY489\npoKCAhUXFys0NNR0HPgZingIfP/WWzX7v/5LK/vwP/WzlqUDWVn6xa9/rZKSEnvqPXbsmL3Gm56e\nrsmTJw98cMBPuFwuPfTQQ3rnnXdUUFDAkZsYUhTxIGtsbNRXJ01SXWfnRdeEL6dF0lWWJcvhUHJy\nsl2+cXFxHJgADKDu7m7dfffdOnz4sLZt26ZRo0aZjgQ/QREPstynn9b7P/6xNnZ29vk7lo4cqa+t\nWaPV//APA5gMwF86d+6cbrvtNnV1demVV15RQECA6UjwA4xUg6ymqkqJ/ShhSbruzBnVvf/+ACUC\ncCkBAQF66aWX1NnZqeXLl6u7u9t0JPgBiniQnTx+XP3dlypEUltr60DEAXAZI0eO1Kuvvqr6+nr9\n8Ic/FDcNMdgo4kE2OjRUbf38jjZJIRwnCAwZh8Ohbdu2qbKyUqtXr6aMMago4kEWGx+vfYGB/fqO\niqAgxcbFDVAiAD3xla98RTt37lR+fr7++Z//2XQc+DAe1hpkA/HU9JTAQNXU1w/6HtQALnTkyBEl\nJyfrwQcf1EMPPWQ6DnwQE/EgGzt2rG5ctEib+riX8ybL0uLMTEoYMGTChAkqLCzUv/zLv2jjxo2m\n48AHMREPgcHYWQvA0KqpqVFqaqqee+45fec73zEdBz6EiXgIJCQkaE1urhY4HKrt4WfO7zW9JjeX\nEgY8QGxsrPLz8/Xggw9qx44dpuPAh1DEQ+S+FSu0OjdXSQ6HnrUsXeplpBZJP7csJfXwwAcAQ+fr\nX/+6tm7dqmXLlmn37t2m48BHcGt6iFVWVmptTo5e37FDWZalhI4O+zziMkn5o0bpphtv1MPZ2UzC\ngIcqKSnRd7/7XW3btk1/8zd/YzoOvBxFbEhTU5M25+Wpprpaba2tCgkL07733tPS5cu1cuVK0/EA\nXMbrr7+ue+65R7t27VJ8fLzpOPBiFLEHeeGFF7Rr1y69/PLLpqMA6IH/+I//0N/93d+ppKREsbGx\npuPAS1HEHqS+vl7f/OY31dDQwMlKgJfYuHGj1qxZo/LyckVHR5uOAy/Ev/YeJDo6WmFhYXrvvfdM\nRwHQQ3fffbceeeQROZ1OHT161HQceCGK2MNkZGRo165dpmMA6IWVK1fqzjvvVEZGhlpaWkzHgZeh\niD0MRQx4p3/8x3/UwoULtXDhQrW19feoF/gT1og9zPHjxzVx4kQ1NjYqKCjIdBwAveByufTAAw/o\nT3/6k/Lz8/k7jB5hIvYwoaGhiouL0549e0xHAdBLlmVp3bp1mjhxov72b/9WZ86cMR0JXoAi9kBO\np5Pb04CXGjZsmH7zm99o5MiR+t73vqdz586ZjgQPRxF7INaJAe82YsQIvfzyyzp27JjuvfdedXd3\nm44ED8YasQc6e/asIiIiVFtby/GHgBc7deqU5s+fr9mzZ+u5556T1cfjUOHbmIg90IgRI5ScnKzi\n4mLTUQD0Q3BwsLZv367y8nI98cQTpuPAQ1HEHorb04BvGDNmjAoKCvTqq6/qqaeeMh0HHogi9lDn\nH9hi5QDwfpGRkSosLNTzzz+vf/u3fzMdBx4mwHQAXNyMGTN07tw5HTp0iM3kAR8QFRWlwsJCpaSk\nKCQkRHfeeafpSPAQFLGHsixLGRkZKiwspIgBHxETE6OCggKlp6dr9OjRysrKMh0JHoBb0x6MdWLA\n93zta1/T9u3bdf/996ugoMB0HHgAXl/yYEePHtWMGTPU1NSkgABuXgC+ZM+ePbrlllu0ZcsWzZ07\n13QcGMRE7MHGjx+vq666ShUVFaajABhgN9xwg1566SXdeuut2r9/v+k4MIgi9nDcngZ8V0ZGhjZs\n2KAbb7xRf/zjH03HgSEUsYc7/8AWAN90yy23KDc3VwsWLNBHH31kOg4MYI3Yw506dUrjxo3TkSNH\nFBISYjoOgEHy/PPP66mnnlJZWZkmTpxoOg6GEBOxhwsODlZCQoJKS0tNRwEwiO6//3498MADysjI\nUGNjo+k4GEIUsRdgnRjwD6tWrdKSJUu0YMECHTt2zHQcDBGK2AuwTgz4jzVr1iglJUWZmZk6efKk\n6TgYAqwRe4Guri6NHTtWVVVVioqKMh0HwCDr7u7Wvffeq08++USvv/66AgMDTUfCIGIi9gLDhw9X\nWloaUzHgJ4YNG6YNGzboiiuu0He/+12dPXvWdCQMIorYS7BODPiX4cOH67e//a26urq0dOlSdXV1\nmY6EQcKtaS9RV1enOXPm6MiRI7Isy3QcAEOko6NDmZmZmjZtmp5//nn+/vsgJmIvERMTo+DgYB08\neNB0FABDKCgoSFu3blVVVZVWrVrFGeU+iCL2ItyeBvxTSEiIduzYocLCQv30pz81HQcDjCL2Ik6n\nkyIG/FR4eLj+8Ic/6MUXX9Szzz5rOg4GEGvEXqSlpUWTJk1Sc3OzRo0aZToOAAPq6+uVnJysxx9/\nXPfee6/pOBgATMReJDw8XDNmzNDevXtNRwFgSHR0tHbt2qWf/OQnevnll03HwQCgiL0M68QApk2b\npoKCAq1cuVLbtm0zHQf9RBF7GYoYgCTNnDlT27Zt0z333KOioiLTcdAPrBF7mdOnTysiIkKffPKJ\nwsPDTccBYFhpaam+/e1va+vWrbr++utNx0EfMBF7mVGjRmnu3LkqLi42HQWAB0hJSdHmzZt1yy23\n6N133zUdB31AEXshTmMC8GWLFi3SunXrlJmZqQ8//NB0HPRSgOkA6L2MjAytW7fOdAwAHuTb3/62\nTp48qYyMDJWVlWny5MmmI6GHKGIvNHPmTJ06dUp1dXWKiYkxHQeAh1i2bJna2trkdDpVVlamK6+8\n0nQk9AC3pr2QZVnssgXgoh588EHdfffdysjIUHNzs+k46AGK2EuxTgzgUh577DHdfPPNWrhwoU6c\nOGE6Di6D15e81Oeff674+Hg1NjZq+PDhpuMA8DAul0s/+tGPVF1drZ07d8rhcJiOhEtgIvZSUVFR\nGj9+vA4cOGA6CgAPZFmW/vVf/1WTJ09WVlaWTp8+bToSLoEi9mKsEwP4a4YNG6aNGzdq9OjRuuOO\nO3Tu3DnTkXARFLEXY50YwOUEBATopZde0qlTp3TPPfeou7vbdCT8BdaIvVhbW5uuvPJKNTQ0sP4D\n4K9qb2/XwoULFRcXp1/+8peyLMt0JPwZE7EXCwkJ0bXXXquysjLTUQB4OIfDoW3btuntt9/WY489\nZjoOvoQi9nKsEwPoqdDQUO3cuVNbt25VTk6O6Tj4M4rYy3EsIoDeiIiIUGFhoV544QX98pe/NB0H\nYotLr5eQkKBPP/1UR48e1fjx403HAeAFJkyYoMLCQiUnJ2v06NFatmyZ6Uh+jYnYywUEBCg1NZWD\nwQH0yuTJk/WHP/xB2dnZ+v3vf286jl+jiH0At6cB9MX06dOVn5+vH/7wh8rPzzcdx2/x+pIPqKmp\nUVpamj777DNeSQDQa3v37tW3vvUtvfLKK0pJSTEdx+8wEfuAadOmKSAgQB988IHpKAC80PXXX6/f\n/e53WrJkiSoqKkzH8TsUsQ+wLIvb0wD6JT09XS+88IIWL16s6upq03H8CkXsIyhiAP1100036bnn\nntPChQt16NAh03H8BmvEPqK5uVlTpkxRc3OzRowYYToOAC/261//Wk8++aTKy8t11VVXmY7j85iI\nfURERISmTJmit956y3QUAF7uBz/4gR5++GE5nU41NDSYjuPzKGIfwmlMAAbKI488ojvuuEMZGRlq\naWkxHcenUcQ+hHViAAPpn/7pn5SRkaHMzEy1tbWZjuOzWCP2IZ2dnYqMjNRnn32m0NBQ03EA+ACX\ny6X7779ftbW12r59u4KCgkxH8jlMxD4kMDBQ1113nUpKSkxHAeAjLMvS+vXrNX78eC1ZskRnzpwx\nHcnnUMQ+hnViAANt+PDh2rRpk4YNG6Y777xTXV1dpiP5FG5N+5h33nlHt912mz788EPTUQD4mM7O\nTi1evFiTJk3Sr371Kw0b9r+zXGNjozbn5ammqkonjx/X6NBQxcbHa+ny5YqMjDSY2vNRxD6mu7tb\n48ePV2VlpaKjo03HAeBjTp48qfnz5ysxMVHPPvusKisrtTYnR9vz83WrpITOToVIapO0LyhIW1wu\n3bhokR7OzlZCQoLh9J6JIvZBt99+u5xOp+655x7TUQD4oGPHjiktLU0TJ0xQZWmpVnd0aKnLpbCL\n/G6rpDzL0tNBQVqTm6v7VqwY6rgejzViH+R0OnmNCcCgGTNmjL53++3av3OnytvbtfISJSxJYZIe\ncblU3t6up1at0ob164cyqldgIvZB9fX1+uY3v6mGhga3NRwAGAgVFRW6OTVV5e3tmtqLz9VKSnI4\ntK20VLNnzx6seF6Hf6V9UHR0tMLDw/Xee++ZjgLAB63NydHqjo5elbAkTZX0aEeH1ubkDEYsr0UR\n+yh22QIwGBobG7U9P19L+3gzdanLpdd37FBTU9MAJ/NeFLGPYp0YwGDYnJenLOmSa8KXEy4py7K0\nOS9v4EJ5OYrYR6Wlpemtt95SR0eH6SgAfEhNVZUSOzv79R0JHR2qqa4eoETejyL2UaGhoYqLi9Oe\nPXtMRwHgQ04eP66Qfn5HiKS21taBiOMTKGIfxjoxgIE2OjRU/T2HqU1SSFhfb277HorYh1HEAAZa\nbHy89gUG9us7KoKCFBsXN0CJvB/vEfuws2fPKiIiQh999JEiIiJMxwHgAxobG/XVSZNU19nZpwe2\nWiRNCQxUTX09e1D/GROxDxsxYoSSk5NVVFRkOgoAHzF27FjduGiRNllWnz6/ybK0ODOTEv4SitjH\ncXsawEB7ODtbTwUFqbaXn6uV9HRQkB7Ozh6MWF6LIvZx54uYFQgAAyUhIUFrcnO1wOHocRnXSlrg\ncGhNbi7bW/4FitjHTZ8+XV1dXTp06JDpKAB8yH0rVmh1bq6SHA49a1m61MtILZJ+bllKcji0mtOX\nLooi9nGWZcnpdKqwsNB0FAA+5r4VK7SttFQHsrIUExiou4OCtF7Si5LWS7o7KEhTAgP1TlaWtpWW\nUsKXwFPTfuDf//3f9fvf/15btmwxHQWAj2pqatLmvDzVVFerrbVVIWFhio2L013LlvFg1mVQxH6g\noaFB06dPV1NTkwICAkzHAQB8Cbem/cC4ceMUHR2tiooK01EAAH+BIvYTrBMDgGeiiP0E7xMDgGdi\njdhPtLe3a9y4cTp8+LBCQvp7dgoAYKAwEfsJh8OhhIQElZaWmo4CAPgSitiPcHsaADwPRexHeGAL\nADwPa8R+pKurS2PHjlVVVZWioqJMxwEAiInYrwwfPlzz5s1jKgYAD0IR+xnWiQHAs3Br2s/U1dVp\nzpw5OnLkiKw+HuwNABg4TMR+JiYmRsHBwTp48KDpKAAAUcR+idvTAOA5KGI/RBEDgOdgjdgPtba2\nKjo6Ws3NzRo1apTpOADg15iI/VBYWJhmzJihvXv3mo4CAH6PIvZT3J4GAM9AEfspihgAPANrxH7q\n9OnTioyM1Mcff6zw8HDTcQDAbzER+6lRo0Zp7ty5KikpMR0FAPwaRezHnE4nt6cBwDCK2I+xTgwA\n5lHEfmzmzJlqb29XXV2d6SgA4LcoYj9mWRa3pwHAMIrYzzmdTs4nBgCDeH3Jz3322We65ppr9MQT\nT2jixIm67bbbTEcCAL9CEfux3bt367bbblNDQ4MkKSkpSWVlZYZTAYB/oYj9WH19vSZNmmT/HBAQ\noJaWFoWEhBhMBQD+hTViPxYdHa1p06bZP587d46JGACGGEXs5zIyMtx+5glqABhaFLGfo4gBwCzW\niP3c8ePHdcUVV6irq8u+9tlnnykqKspgKgDwH0zEfi40NFSJiYlu13ivGACGDkUMOZ1Ot58pYgAY\nOhQxLlgnLiwsFCsWADA0WCOGzp49q/DwcJ08edK+VlVVpbi4OIOpAMA/MBFDI0aMUGpqqts1np4G\ngKFBEUMSrzEBgCncmoYk6f3339c111xj/+xwONTS0qJRo0YZTAUAvo+JGJKkGTNm6Morr7R/bm9v\n1969ew0mAgD/QBFDkmRZFrenAcAAihg2ihgAhh5rxLAdPXpUEyZMsH+2LEvNzc0KDw83mAoAfBsT\nMWzjx493e3fY5XKppKTEYCIA8H0UMdxwexoAhhZFDDcUMQAMLdaI4ebUqVMKDw/XmTNn7GsfffSR\nYmJiDKYCAN/FRAw3wcHBmjNnjts1pmIAGDwUMS5wsdOYAACDgyLGBf6yiIuKitTV1WUoDQD4NooY\nF5g1a5bCwsLsn1tbW3XgwAGDiQDAd1HEuMDw4cOVnp7udo11YgAYHBQxLsrpdLr9TBEDwODg9SVc\nVF1dnaZMmWL/PHLkSLW0tCg4ONhgKgDwPUzEuKiYmBi3d4fPnDmj8vJyg4kAwDdRxLgkdtkCgMFH\nEeOSKGIAGHysEeOSWlpaFBERIZfLJUtSoKRFGRm6YuxYxcbHa+ny5YqMjDQdEwC8GkWMS6qoqNAt\n8+er5djd/3DAAAAC3ElEQVQxZUlKlhQiqU3SvqAgbXG5dOOiRXo4O1sJCQlmwwKAl6KIcVEb1q/X\nj1et0v9tb9dySWEX+Z1WSXmWpaeDgrQmN1f3rVgxxCkBwPtRxLjAhvXr9dSqVSpob9fUHvx+raQF\nDodWU8YA0GsUMdxUVFTo5tRUlfewhM+rlZTkcGhbaalmz549WPEAwOfw1DTcrM3J0eqOjl6VsCRN\nlfRoR4fW5uQMRiwA8FlMxLA1Njbqq5Mmqa6z86JrwpfTImlKYKBq6ut5mhoAeoiJGLbNeXnK0sUf\nzOqJcElZlqXNeXkDFwoAfBxFDFtNVZUSOzv79R0JHR2qqa4eoEQA4PsoYthOHj+ukH5+R4ikttbW\ngYgDAH6BIoZtdGio2vr5HW2SQsL6enMbAPwPRQxbbHy89gUG9us7KoKCFBsXN0CJAMD38dQ0bDw1\nDQBDj4kYtrFjx+rGRYu0ybL69PlNlqXFmZmUMAD0AhMx3LCzFgAMLSZiuElISNCa3FwtcDhU28PP\nnN9rek1uLiUMAL1EEeMC961YodW5uUpyOPSsZelSLyO1SPq5ZSmJAx8AoM+4NY1Lqqys1NqcHL2+\nY4eyLEsJHR32ecQVfz6PeHFmph7OzmYSBoA+oohxWU1NTdqcl6ea6mq1tbYqJCxMsXFxumvZMh7M\nAoB+oogBADCINWIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyi\niAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACD\nKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDA\nIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEAMIgiBgDAIIoYAACDKGIAAAyiiAEA\nMOj/A/fhWtcNWRABAAAAAElFTkSuQmCC\n",
      "text/plain": [
       "<matplotlib.figure.Figure at 0x7f6edd0930f0>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import networkx as nx\n",
    "%matplotlib inline\n",
    "\n",
    "results = %cypher MATCH p = (:Person)-[:LIKES]->(:Drink) RETURN p\n",
    "\n",
    "g = results.get_graph()\n",
    "\n",
    "nx.draw(g)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('123', {'calories': 0, 'labels': ['Drink'], 'name': 'Coke Zero'}),\n",
       " ('120', {'age': 24, 'labels': ['Person'], 'name': 'Nicole'}),\n",
       " ('122', {'calories': 9000, 'labels': ['Drink'], 'name': 'Mountain Dew'}),\n",
       " ('121', {'age': 20, 'labels': ['Person'], 'name': 'Drew'})]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g.nodes(data=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'120': 2, '121': 1, '122': 2, '123': 1}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nx.degree(g)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# igraph\n",
    "\n",
    "Cypher query results can be imported into `igraph` with `py2neo`. You'll need to install `igraph` with `pip install python-igraph`. Query results should be returned as edgelists, as `igraph` has a method for building an `igraph` object from a list of tuples representing edges between nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('person.name': 'Nicole', 'drink.name': 'Mountain Dew'),\n",
       " ('person.name': 'Nicole', 'drink.name': 'Coke Zero'),\n",
       " ('person.name': 'Drew', 'drink.name': 'Mountain Dew')]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from py2neo import Graph as PGraph\n",
    "from igraph import Graph as IGraph\n",
    "\n",
    "neo4j = PGraph()\n",
    "\n",
    "query = \"\"\"\n",
    "MATCH (person:Person)-[:LIKES]->(drink:Drink)\n",
    "RETURN person.name, drink.name\n",
    "\"\"\"\n",
    "\n",
    "data = [_ for _ in neo4j.run(query)]\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<igraph.Graph at 0x7f6eda27a318>"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "ig = IGraph.TupleList(data)\n",
    "\n",
    "ig"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Nicole', 'Mountain Dew']"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "best = ig.vs.select(_degree = ig.maxdegree())[\"name\"]\n",
    "best"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {
    "collapsed": true,
    "slideshow": {
     "slide_type": "slide"
    }
   },
   "source": [
    "# jgraph\n",
    "\n",
    "`jgraph` will plot tuple lists as 3D graphs."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "fragment"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-0eab60ab-c4f7-488d-9b4f-f088bd8dadf3\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-0eab60ab-c4f7-488d-9b4f-f088bd8dadf3');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 1, \"target\": 2 },\n",
       "        { \"source\": 2, \"target\": 3 },\n",
       "        { \"source\": 3, \"target\": 4 },\n",
       "        { \"source\": 4, \"target\": 1 },\n",
       "        { \"source\": 4, \"target\": 5 },\n",
       "        { \"source\": 5, \"target\": 2 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"1\": { \"location\": [ -2.000, -1.963, -1.886 ] },\n",
       "        \"2\": { \"location\": [ -1.095, -1.074, -1.077 ] },\n",
       "        \"3\": { \"location\": [ -0.194, -0.079, 0.108 ] },\n",
       "        \"4\": { \"location\": [ 1.188, 1.137, 0.772 ] },\n",
       "        \"5\": { \"location\": [ 2.000, 1.980, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "import jgraph\n",
    "\n",
    "jgraph.draw([(1, 2), (2, 3), (3, 4), (4, 1), (4, 5), (5, 2)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {
    "collapsed": false,
    "slideshow": {
     "slide_type": "subslide"
    }
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div id=\"graph-a16d99c5-b8b8-43f5-a94a-39a7bd4043d0\"></div>\n",
       "           <script type=\"text/javascript\">\n",
       "           require.config({baseUrl: '/',\n",
       "                             paths: {jgraph: ['nbextensions/jgraph.min', 'https://rawgit.com/patrickfuller/jgraph/master/js/build/jgraph.min']}});\n",
       "           require(['jgraph'], function () {\n",
       "               var $d = $('#graph-a16d99c5-b8b8-43f5-a94a-39a7bd4043d0');\n",
       "               $d.width(600); $d.height(400);\n",
       "               $d.jgraph = jQuery.extend({}, jgraph);\n",
       "               $d.jgraph.create($d, {nodeSize: 2.000000,\n",
       "                                     edgeSize: 0.250000,\n",
       "                                     defaultNodeColor: '0x5bc0de',\n",
       "                                     defaultEdgeColor: '0xaaaaaa',\n",
       "                                     shader: 'basic',\n",
       "                                     z: 100,\n",
       "                                     runOptimization: true,\n",
       "                                     directed: true,\n",
       "                                     showSave: false});\n",
       "               $d.jgraph.draw({\n",
       "    \"edges\": [\n",
       "        { \"source\": 120, \"target\": 122 },\n",
       "        { \"source\": 120, \"target\": 123 },\n",
       "        { \"source\": 121, \"target\": 122 },\n",
       "        { \"source\": 124, \"target\": 123 },\n",
       "        { \"source\": 125, \"target\": 122 }\n",
       "    ],\n",
       "    \"nodes\": {\n",
       "        \"120\": { \"location\": [ -2.000, -2.000, -2.000 ] },\n",
       "        \"121\": { \"location\": [ -1.841, -1.463, -1.292 ] },\n",
       "        \"122\": { \"location\": [ -0.610, -0.576, -0.393 ] },\n",
       "        \"123\": { \"location\": [ 0.591, 0.411, 0.181 ] },\n",
       "        \"124\": { \"location\": [ 1.755, 1.493, 1.297 ] },\n",
       "        \"125\": { \"location\": [ 2.000, 2.000, 2.000 ] }\n",
       "    }\n",
       "});\n",
       "\n",
       "               $d.resizable({\n",
       "                   aspectRatio: 600 / 400,\n",
       "                   resize: function (evt, ui) {\n",
       "                       $d.jgraph.renderer.setSize(ui.size.width,\n",
       "                                                  ui.size.height);\n",
       "                   }\n",
       "               });\n",
       "           });\n",
       "           </script>"
      ],
      "text/plain": [
       "<IPython.core.display.HTML object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "data = graph.run(\"MATCH (n)-->(m) RETURN ID(n), ID(m)\")\n",
    "data = [tuple(x) for x in data]\n",
    "\n",
    "jgraph.draw(data)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.5.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
